Вам даны две строки AAA и BBB одинаковой длины, состоящие из строчных латинских букв. Требуется определить минимальное количество циклических сдвигов строки AAA, после которых она станет равной строке BBB.

#### Определения:

- Циклический сдвиг строки вправо: все символы строки сдвигаются на одну позицию вправо, а последний символ становится первым.

Например, если строка A="abcde"A = "abcde"A="abcde", то после одного циклического сдвига она станет "eabcd""eabcd""eabcd", а после двух — "deabc""deabc""deabc".

#### Входные данные:

- Две строки AAA и BBB одинаковой длины (1 ≤ длина строк ≤ 100).

#### Выходные данные:

- Выведите минимальное количество циклических сдвигов строки AAA, чтобы она стала равной строке BBB. Если это невозможно, выведите `-1`.


## Решение 
```python 
def loli(a, b):
    n = len(a[0])
    current_a = a[0]

    for i in range(n):
        if current_a == b[0]:
            return i  # Возвращаем количество сдвигов, если строки равны
        # Циклический сдвиг вправо
        current_a = current_a[-1] + current_a[:-1]  # Сдвигаем строку

    return -1  # Если не удалось получить строку B

a = ['abcde']
b = ['bcdea']

print(loli(a, b))

...

4
```
